tutorials/jets/CNRS_jet_old/flow_3D/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    HeInlet
    {
        type            zeroGradient;
    }   

    airInlet
    {
        type            totalPressure;
        p0              $internalField;
    }

    dielWalls
    {
        type            zeroGradient;
    }

    outlet
    {
        type            totalPressure;
        p0              $internalField;
    }

    farfield
    {
        type            totalPressure;
        p0              $internalField;
    }
}


// ************************************************************************* //
